steup/contiki/cpu/arm/atsam3s4/usb-arch.c
#include "atsam3s4_usb-arch.h"

static void notify_process(unsigned int e)
{
	events |= e;
	
	if (event_process)
	{
		process_poll(event_process);
	}
}

static void notify_ep_process(USBEndpoint *ep, unsigned int e)
{
	ep->events |= e;
	
	if (ep->event_process)
	{
		process_poll(ep->event_process);
	}
}

static void usb_arch_reset(void)
{
	unsigned int e;
	
	for (e = 0; e < USB_MAX_ENDPOINTS; ++e)
	{
		if (usb_endpoints[e].flags &USB_EP_FLAGS_ENABLED)
		{
			USBBuffer *buffer = usb_endpoints[e].buffer;
			usb_endpoints[e].flags = 0;
			
			while (buffer)
			{
				buffer->flags &= ~USB_BUFFER_SUBMITTED;
				buffer = buffer->next;
			}
		}
	}
	
	usb_arch_setup_control_endpoint(0);  
	USB->DADDR = 0x80;
}

void usb_arch_setup(void)
{
	unsigned int i;
	RCC->APB1RSTR |= RCC_APB1RSTR_USBRST;
	RCC->APB2ENR |=  (RCC_APB2ENR_AFIOEN | RCC_APB2ENR_IOPAEN);
	RCC->APB1ENR |= (RCC_APB1ENR_USBEN);
	RCC->APB1RSTR &= ~RCC_APB1RSTR_USBRST;

	GPIO_CONF_OUTPUT_PORT(A,11,ALT_PUSH_PULL,50);
	GPIO_CONF_OUTPUT_PORT(A,12,ALT_PUSH_PULL,50);
	GPIO_CONF_OUTPUT_PORT(A,10, PUSH_PULL, 2);
	GPIOA->BSRR = GPIO_BSRR_BR10;

	/* Turn on analog part */
	USB->CNTR &= ~USB_CNTR_PDWN;

	for (i = 0; i < 24; ++i)
	{
		asm("nop"::); /* Wait at least 1us */
	}
	
	/* Release reset */
	USB->CNTR &= ~USB_CNTR_FRES;
	
	/* Clear any interrupts */
	USB->ISTR = ~(USB_ISTR_PMAOVR |USB_ISTR_ERR | USB_ISTR_WKUP | USB_ISTR_SUSP
		| USB_ISTR_RESET);

	for(i = 0; i < USB_MAX_ENDPOINTS; ++i)
	{
		usb_endpoints[i].flags = 0;
		usb_endpoints[i].event_process = 0;
	}
	
	/* Put buffer table at beginning of buffer memory */
	USB->BTABLE = 0;
	usb_arch_reset();
	GPIOA->BSRR = GPIO_BSRR_BS10;
	USB->CNTR |= (USB_CNTR_CTRM | USB_CNTR_PMAOVRM | USB_CNTR_ERRM
		| USB_CNTR_WKUPM| USB_CNTR_SUSPM | USB_CNTR_RESETM);
	NVIC_SET_PRIORITY(USB_LP_CAN_RX0_IRQChannel, 4);
	NVIC_ENABLE_INT(USB_LP_CAN_RX0_IRQChannel);
}

static void usb_arch_setup_endpoint(unsigned char addr)
{
	USBEndpoint *ep = EP_STRUCT(addr);
	ep->status = 0;
	ep->flags = USB_EP_FLAGS_ENABLED;
	ep->buffer = 0;
	ep->addr = addr;
	ep->events = 0;
	ep->xfer_size = 0;
}

void usb_arch_setup_control_endpoint(unsigned char addr)
{
	USB_HW_Buffer *buf_desc;
	unsigned int ei = EP_HW_NUM(addr);
	unsigned int epr;
	USBEndpoint *ep = EP_STRUCT(addr);
	usb_arch_setup_endpoint(addr);
	ep->flags |= USB_EP_FLAGS_TYPE_CONTROL;

	buf_desc = USB_EP_BUF_DESC(ei);
	buf_desc->ADDR_TX = USB_EP_BUF_OFFSET(ei);
	buf_desc->COUNT_TX = USB_EP_BUF_SIZE(ei)/2;
	buf_desc->ADDR_RX = USB_EP_BUF_OFFSET(ei) + USB_EP_BUF_SIZE(ei)/2;
	buf_desc->COUNT_RX = USB_EP_BUF_CAPACITY(USB_EP_BUF_SIZE(ei)/2);
	ep->xfer_size = USB_EP_BUF_SIZE(ei)/2;
	epr = USB->EPR[EP_HW_NUM(addr)];
	/* Clear interrupt flags */
	epr &= ~(USB_EP0R_CTR_RX | USB_EP0R_CTR_TX);
	/* NACK both directions */
	epr ^= USB_EPxR_STAT_RX_NAK | USB_EPxR_STAT_TX_NAK;
	/* Set control type */
	epr = ((epr & ~(USB_EP0R_EP_TYPE | USB_EP0R_EP_KIND))
	 | USB_EPxR_EP_TYPE_CONTROL);
	/* Set address */
	epr = ((epr & ~USB_EP0R_EA) | addr);
	USB->EPR[EP_HW_NUM(addr)] = epr; 
}

void usb_arch_setup_bulk_endpoint(unsigned char addr)
{
	USB_HW_Buffer *buf_desc;
	unsigned int ei = EP_HW_NUM(addr);
	unsigned int epr;
	USBEndpoint *ep = EP_STRUCT(addr);
	usb_arch_setup_endpoint(addr);
	ep->flags |= USB_EP_FLAGS_TYPE_BULK;

	buf_desc = USB_EP_BUF_DESC(ei);
	buf_desc->ADDR_TX = USB_EP_BUF_OFFSET(ei);
	buf_desc->ADDR_RX = USB_EP_BUF_OFFSET(ei) + USB_EP_BUF_SIZE(ei)/2;
	epr = USB->EPR[ei];
	
	if (addr & 0x80)
	{
		/* IN */
		buf_desc->COUNT_TX_0 = 0;
		buf_desc->COUNT_TX_1 = 0;
		/* VALID transmission */
		epr ^= USB_EPxR_STAT_TX_VALID;
	}
	else
	{
		/* OUT */
		buf_desc->COUNT_RX_0 = USB_EP_BUF_CAPACITY(USB_EP_BUF_SIZE(ei)/2);
		buf_desc->COUNT_RX_1 = USB_EP_BUF_CAPACITY(USB_EP_BUF_SIZE(ei)/2);

		/* VALID reception  */
		epr ^= USB_EPxR_STAT_RX_VALID;
	}
	
	ep->xfer_size = USB_EP_BUF_SIZE(ei)/2;
	/* Clear interrupt flags */
	epr &= ~(USB_EP0R_CTR_RX | USB_EP0R_CTR_TX);
	/* Set bulk type */
	epr = ((epr & ~(USB_EP0R_EP_TYPE | USB_EP0R_EP_KIND))
	| USB_EPxR_EP_TYPE_BULK | USB_EPxR_EP_DBL_BUF);
	/* Set address */
	epr = ((epr & ~USB_EP0R_EA) | addr);
	USB->EPR[ei] = epr;
}

void usb_arch_setup_interrupt_endpoint(unsigned char addr)
{
	USB_HW_Buffer *buf_desc;
	unsigned int ei = EP_HW_NUM(addr);
	unsigned int epr;
	USBEndpoint *ep = EP_STRUCT(addr);
	usb_arch_setup_endpoint(addr);
	ep->flags |= USB_EP_FLAGS_TYPE_INTERRUPT;

	epr = USB->EPR[EP_HW_NUM(addr)];

	buf_desc = USB_EP_BUF_DESC(ei);
	
	if (addr & 0x80)
	{
		/* IN */
		buf_desc->ADDR_TX = USB_EP_BUF_OFFSET(ei);
		buf_desc->COUNT_TX = USB_EP_BUF_SIZE(ei);
		epr ^= USB_EPxR_STAT_TX_NAK;
	}
	else
	{
		/* OUT */
		buf_desc->ADDR_RX = USB_EP_BUF_OFFSET(ei);
		buf_desc->COUNT_RX = USB_EP_BUF_CAPACITY(USB_EP_BUF_SIZE(ei));
		epr ^= USB_EPxR_STAT_RX_NAK;
	}
	
	ep->xfer_size = USB_EP_BUF_SIZE(ei);
	/* Clear interrupt flags */
	epr &= ~(USB_EP0R_CTR_RX | USB_EP0R_CTR_TX);
	/* Set control type */
	epr = ((epr & ~(USB_EP0R_EP_TYPE | USB_EP0R_EP_KIND))
	| USB_EPxR_EP_TYPE_INTERRUPT);
	/* Set address */
	epr = ((epr & ~USB_EP0R_EA) | addr);
	USB->EPR[EP_HW_NUM(addr)] = epr; 
}

void usb_arch_disable_endpoint(uint8_t addr)
{
	unsigned int epr;
	USBEndpoint *ep = EP_STRUCT(addr);
	ep->flags &= ~USB_EP_FLAGS_ENABLED;

	epr = USB->EPR[EP_HW_NUM(addr)];

	epr ^= USB_EPxR_STAT_TX_DISABLED | USB_EPxR_STAT_RX_DISABLED;
	/* Clear interrupt flags */
	epr &= ~(USB_EP0R_CTR_RX | USB_EP0R_CTR_TX);
	USB->EPR[EP_HW_NUM(addr)] = epr; 
}

/* Skip buffers until mask and flags matches*/
static USBBuffer *skip_buffers_until(USBBuffer *buffer, unsigned int mask, unsigned int flags, unsigned int *resp)
{
	while(buffer && !((buffer->flags & mask) == flags))
	{
		USBBuffer *next = buffer->next;
		buffer->flags &= ~USB_BUFFER_SUBMITTED ;
		buffer->flags |= USB_BUFFER_FAILED;
		
		if (buffer->flags & USB_BUFFER_NOTIFY)
		{
			*resp |= USB_READ_NOTIFY;
		}
		
		buffer = next;
	}
	
	return buffer;
}

static void read_hw_buffer(USBBuffer *buffer, unsigned int offset, unsigned int len)
{
#ifdef USB_STM32F103_ENABLE_ALT_COPY
	if (buffer->flags & USB_BUFFER_ARCH_ALT_COPY)
	{
		copy_from_hw_buffer(buffer, offset, len);
	}
	else
#endif /* USB_STM32F103_ENABLE_ALT_COPY */
	{
		uint8_t *data = buffer->data;
		
		const uint32_t *hw_data = ((uint32_t*)USB_MEM_BASE) + offset / 2;
		
		buffer->data += len;
		
		if (offset & 1)
		{
			*data++ = *hw_data++ >> 8;
			--len;
		}
		
		while (len >= 2)
		{
			*((uint16_t*)data) = *hw_data++;
			data += 2;
			len -= 2;
		}
		
		if (len == 1)
		{
			*data++ = *hw_data;
		}
	}
}

void write_hw_buffer(USBBuffer *buffer,unsigned int offset, unsigned int len)
{
#ifdef USB_STM32F103_ENABLE_ALT_COPY
	if (buffer->flags & USB_BUFFER_ARCH_ALT_COPY)
	{
		copy_to_hw_buffer(buffer, offset, len);
	}
	else
#endif    
	{
		const uint8_t *data;
		uint32_t *hw_data;
		
		if (len == 0)
		{
			return;
		}
		
		data = buffer->data;
		hw_data = ((u32*)USB_MEM_BASE) + offset/2;
		buffer->data += len;
		
		if (offset & 1)
		{
			*hw_data = (*hw_data & 0xff) | (*data++ << 8);
			++hw_data;
			--len;
		}
		
