steup/contiki/cpu/arm/atsam3s4/usb-arch.c
		while(len >= 2)
		{
			*hw_data++ = *((uint16_t*)data) ;
			data += 2;
			len -= 2;
		}
		
		if (len == 1)
		{
			*hw_data = *data++;
		}
	}
}

static unsigned int get_receive_capacity(USBBuffer *buffer)
{
  unsigned int capacity = 0;
  while(buffer && !(buffer->flags & (USB_BUFFER_IN| USB_BUFFER_SETUP|USB_BUFFER_HALT))) {
    capacity += buffer->left;
    buffer = buffer->next;
  }
  return capacity;
}

static int handle_pending_receive(USBEndpoint *ep)
{
	int short_packet;
	unsigned int len = 0;
	unsigned int copy;
	unsigned int res = 0;
	volatile unsigned int hw_offset;
	unsigned int hw_ep = EP_HW_NUM(ep->addr);
	USBBuffer *buffer = ep->buffer;
	unsigned int flags = ep->flags;
	USB_HW_Buffer *buf_desc = USB_EP_BUF_DESC(hw_ep);
	PRINTF("handle_pending_receive:\n");
	
	if (!(flags & USB_EP_FLAGS_ENABLED) || !buffer)
	{
		return USB_READ_BLOCK;
	}
	
	switch(flags & USB_EP_FLAGS_TYPE_MASK)
	{
		case USB_EP_FLAGS_TYPE_CONTROL:
			len = buf_desc->COUNT_RX & USB_COUNT0_RX_COUNT0_RX;
			
			if (flags & USB_EP_FLAGS_SETUP_PENDING)
			{
				/* Discard buffers until we find a SETUP buffer */
				buffer = skip_buffers_until(buffer, USB_BUFFER_SETUP, USB_BUFFER_SETUP, &res);
				ep->buffer = buffer;
				
				if (!buffer || buffer->left < len)
				{
					res |= USB_READ_BLOCK;
					return res;
				}
				
				/* SETUP buffer must fit in a single buffer */
				if (buffer->left < len)
				{
					buffer->flags |= USB_BUFFER_FAILED;
					buffer->flags &= ~USB_BUFFER_SUBMITTED ;
					
					if (buffer->flags & USB_BUFFER_NOTIFY)
					{
						res |= USB_READ_NOTIFY;
					}
					
					ep->buffer = buffer->next;
					res |= USB_READ_FAIL;
					return res;
				}
			}
			else
			{
				if (buffer->flags & (USB_BUFFER_SETUP|USB_BUFFER_IN))
				{
					buffer->flags |= USB_BUFFER_FAILED;

					buffer->flags &= ~USB_BUFFER_SUBMITTED ;
					
					if (buffer->flags & USB_BUFFER_NOTIFY) res |= USB_READ_NOTIFY;
					{
						ep->buffer = buffer->next;
					}
					
					res |= USB_READ_FAIL;
					return res;
				}

				if (len == 0)
				{
					/* Status OUT */
					if (buffer->left > 0)
					{
						buffer->flags |= USB_BUFFER_FAILED;
						res |= USB_READ_FAIL;
					}
					
					buffer->flags &= ~USB_BUFFER_SUBMITTED ;
					
					if (buffer->flags & USB_BUFFER_NOTIFY)
					{
						res |= USB_READ_NOTIFY;
					}
					
					ep->buffer = buffer->next;
					return res;
				}
				
				if (get_receive_capacity(buffer) <  len)
				{
					return USB_READ_BLOCK;
				}
			}
			
			hw_offset = buf_desc->ADDR_RX;
			break;
			
		case USB_EP_FLAGS_TYPE_INTERRUPT:
			len = buf_desc->COUNT_RX & USB_COUNT0_RX_COUNT0_RX;
			if (get_receive_capacity(buffer) <  len)
			{
				return USB_READ_BLOCK;
			}
			
			hw_offset =  buf_desc->ADDR_RX;
			break;
			
		case USB_EP_FLAGS_TYPE_BULK:
			if (USB->EPR[hw_ep] & USB_EPxR_SW_BUF_RX)
			{
				len = buf_desc->COUNT_RX_1 & USB_COUNT0_RX_COUNT0_RX;
				hw_offset =  buf_desc->ADDR_RX_1;
			}
			else
			{
				len = buf_desc->COUNT_RX_0 & USB_COUNT0_RX_COUNT0_RX;
				hw_offset =  buf_desc->ADDR_RX_0;
			}
			
			if (get_receive_capacity(buffer) <  len)
			{
				return USB_READ_BLOCK;
			}
			
			break;
			
		case USB_EP_FLAGS_TYPE_ISO:
			len = buf_desc->COUNT_RX & USB_COUNT0_RX_COUNT0_RX;
			
			if (get_receive_capacity(buffer) <  len)
			{
				return USB_READ_BLOCK;
			}
			
			hw_offset =  buf_desc->ADDR_RX;
	}
	
	/* printf("handle_pending_receive: %d %04x\n", len, ep->flags);   */
	short_packet = len < ep->xfer_size;

	do
	{
		if (buffer->left < len)
		{
			copy = buffer->left;
		}
		else
		{
			copy = len;
		}
		
		len -= copy;
		buffer->left -= copy;
		read_hw_buffer(buffer, hw_offset, copy);
		hw_offset += copy;

		if (len == 0)
		{
			break;
		}

		/* Release buffer */
		buffer->flags &= ~(USB_BUFFER_SUBMITTED | USB_BUFFER_SHORT_PACKET);
		
		if (buffer->flags & USB_BUFFER_NOTIFY)
		{
			res |= USB_READ_NOTIFY;
		}
		
		/* Use next buffer. */
		buffer = buffer->next;
	}
	while(1);

	if (short_packet)
	{
		buffer->flags |= USB_BUFFER_SHORT_PACKET;
	}

	if ((buffer->left == 0)
		|| (buffer->flags & USB_BUFFER_PACKET_END)
		|| (short_packet && (buffer->flags & USB_BUFFER_SHORT_END)))
	{
		/* Release buffer */
		buffer->flags &= ~USB_BUFFER_SUBMITTED;
		
		if (buffer->flags & USB_BUFFER_NOTIFY)
		{
			res |= USB_READ_NOTIFY;
		}
		
		/* Use next buffer. */
		buffer = buffer->next;
	}

	ep->buffer = buffer;
	
	if (IS_BULK_EP(ep))
	{
		USB->EPR[hw_ep] = EPR_INVARIANT(USB->EPR[hw_ep]) | USB_EPxR_SW_BUF_RX;
	}

	/* PRINTF("read_endpoint %d %d\n", (int)hw_offset-buf_desc->ADDR_RX, (int)buf_desc->ADDR_RX); */
	return res;
}

static void start_receive(USBEndpoint *ep)
{
  unsigned int hw_ep = EP_HW_NUM(ep->addr);
  uint32_t epr =  (USB->EPR[hw_ep] | EPR_W0);
  uint32_t epr_mask = EPR_RW | EPR_W0;
  switch(ep->flags & USB_EP_FLAGS_TYPE_MASK) {
  case USB_EP_FLAGS_TYPE_CONTROL:
  case USB_EP_FLAGS_TYPE_INTERRUPT:
    {
      unsigned int capacity = get_receive_capacity(ep->buffer);
      if (capacity <= ep->xfer_size) {
	/* This is the last OUT packet of the data stage */
	epr ^= USB_EPxR_STAT_TX_NAK;
      } else {
	epr ^= USB_EPxR_STAT_TX_STALL;
      }
      epr ^= USB_EPxR_STAT_RX_VALID;
      epr_mask |= USB_EP0R_STAT_TX | USB_EP0R_STAT_RX;
    }
    break;
  case USB_EP_FLAGS_TYPE_BULK:
  case USB_EP_FLAGS_TYPE_ISO: 
   break;
  }
  ep->flags |= USB_EP_FLAGS_RECEIVING;
  USB->EPR[hw_ep] = epr & epr_mask;
}

static unsigned int get_transmit_length(USBBuffer *buffer)
{
  unsigned int length = 0;
  while(buffer && (buffer->flags & USB_BUFFER_IN)) {
    length += buffer->left;
    buffer = buffer->next;
  }
  return length;
}

static int start_transmit(USBEndpoint *ep)
{
	unsigned int hw_start;
	unsigned int res = 0;
	USBBuffer *buffer = ep->buffer;
	unsigned int len;
	
	unsigned int hw_offset;
	volatile uint32_t *hw_countp;

	unsigned int hw_ep = EP_HW_NUM(ep->addr);
	uint32_t epr =  USB->EPR[hw_ep];
	unsigned int ep_flags = ep->flags;
	USB_HW_Buffer *buf_desc = USB_EP_BUF_DESC(hw_ep);
	len = ep->xfer_size;

	if (!(ep_flags & USB_EP_FLAGS_ENABLED) || !buffer)
	{
		return USB_WRITE_BLOCK;
	}
	
	/* PRINTF("start_transmit: %02x\n", ep->addr); */
	switch(ep_flags & USB_EP_FLAGS_TYPE_MASK)
	{
		case USB_EP_FLAGS_TYPE_CONTROL:

			if (get_transmit_length(ep->buffer) <= len)
			{
				/* This is the last IN packet of the data stage */
				USB->EPR[hw_ep] = USB_EPxR_EP_STATUS_OUT | EPR_TOGGLE_SET(epr, USB_EP0R_STAT_RX, USB_EPxR_STAT_RX_NAK);
			}
			else
			{
				USB->EPR[hw_ep] = USB_EPxR_EP_STATUS_OUT | EPR_TOGGLE_SET(epr, USB_EP0R_STAT_RX, USB_EPxR_STAT_RX_STALL);
			}
			
