steup/contiki/cpu/arm/atsam3s4/usb-arch.c
			hw_offset =  buf_desc->ADDR_TX;
			hw_countp = &buf_desc->COUNT_TX;
			break;
			
		case USB_EP_FLAGS_TYPE_BULK:
			if (buffer->flags & USB_BUFFER_HALT)
			{
				if (ep->status & 0x01)
				{
					return USB_WRITE_BLOCK;
				}
				
				ep->status |= 0x01;
				stall_bulk_in(hw_ep);
				return USB_WRITE_BLOCK;
			}
			
			if (USB->EPR[hw_ep] & USB_EPxR_SW_BUF_TX)
			{
				hw_offset =  buf_desc->ADDR_TX_1;
				hw_countp = &buf_desc->COUNT_TX_1;
			}
			else
			{
				hw_offset =  buf_desc->ADDR_TX_0;
				hw_countp = &buf_desc->COUNT_TX_0;
			}
			break;
			
		default:
			return res;
	}
	
	hw_start = hw_offset;
	
	while (buffer)
	{
		unsigned int copy;
		
		if (buffer->left < len)
		{
			copy = buffer->left;
		}
		else
		{
			copy = len;
		}
		
		len -= copy;
		buffer->left -= copy;
		write_hw_buffer(buffer, hw_offset, copy);
		hw_offset += copy;
		
		if (buffer->left == 0)
		{
			if (buffer->flags & USB_BUFFER_SHORT_END)
			{
				if (len == 0)
				{
					/* Send zero length packet. */
					break; /* Leave without moving to next buffer */
				}
				else
				{
					len = 0;
				}
			}
			
			/* Release buffer */
			buffer->flags &= ~USB_BUFFER_SUBMITTED;
			
			if (buffer->flags & USB_BUFFER_NOTIFY)
			{
				res = USB_WRITE_NOTIFY;
			}
			
			/* Use next buffer. */
			buffer = buffer->next;
		}
		
		if (len == 0)
		{
			break;
		}
	}
	
	ep->buffer = buffer;
	
	if (ep->flags & USB_EP_FLAGS_TRANSMITTING)
	{
		ep->flags |= USB_EP_FLAGS_DOUBLE;
	}
	else
	{
		ep->flags |= USB_EP_FLAGS_TRANSMITTING;
	}

	*hw_countp = hw_offset - hw_start;

	/* printf("start_transmit: %02x %d %04lx\n", ep->addr, hw_offset - hw_start, USB->EPR[hw_ep]); */
	switch(ep->flags & USB_EP_FLAGS_TYPE_MASK)
	{
		case USB_EP_FLAGS_TYPE_CONTROL:
		case USB_EP_FLAGS_TYPE_INTERRUPT:
			USB->EPR[hw_ep] =
			EPR_TOGGLE_SET(epr, USB_EP0R_STAT_TX, USB_EPxR_STAT_TX_VALID);
			break;
			
		case USB_EP_FLAGS_TYPE_BULK:
			USB->EPR[hw_ep] = EPR_INVARIANT(USB->EPR[hw_ep]) | USB_EPxR_SW_BUF_TX;
			break;
			
		case USB_EP_FLAGS_TYPE_ISO:
			break;
	}
	
	/*   printf("start_transmit: %04x\n", USB->EPR[hw_ep]); */
	return res;
}

static void start_transfer(USBEndpoint *ep)
{
  int res;
  while (1) {
    if (!(ep->addr & 0x80) && (IS_BULK_EP(ep) || IS_INTERRUPT_EP(ep))) {
      if (ep->buffer && (ep->buffer->flags & USB_BUFFER_HALT)) {
	if (ep->status & 0x01) return ;
	ep->status |= 0x01;
	stall_bulk_out(EP_HW_NUM(ep->addr));
	return;
      }
    }
    if (!(ep->flags & USB_EP_FLAGS_RECV_PENDING)) break;
    res = handle_pending_receive(ep);
    if (res & USB_READ_NOTIFY) {
      notify_ep_process(ep, USB_EP_EVENT_NOTIFICATION);
    }
    if (res & USB_READ_BLOCK) return;
    if (ep->flags & USB_EP_FLAGS_DOUBLE) {
      ep->flags &= ~USB_EP_FLAGS_DOUBLE;
    } else {
      ep->flags &= ~(USB_EP_FLAGS_RECV_PENDING|USB_EP_FLAGS_SETUP_PENDING);
    }
    if (res & USB_READ_FAIL) {
      /* Only fails for control endpoints */
      usb_arch_control_stall(ep->addr);
      return;
    }
  }
  if (ep->addr == 0x02)
    PRINTF("start EPR: %04x ep->flags: %02x\n",
	   (unsigned int)USB->EPR[EP_HW_NUM(ep->addr)],
	   (unsigned int)ep->flags);
  if (ep->flags & (USB_EP_FLAGS_TRANSMITTING | USB_EP_FLAGS_RECEIVING)) {
    if (!IS_BULK_EP(ep) || (ep->flags & USB_EP_FLAGS_DOUBLE)) {
      PRINTF("Busy\n");
      return;
    }
  }
  if (ep->status & 0x01) return; /* Don't start transfer if halted */
  if (ep->buffer) {
    if (ep->buffer->flags & USB_BUFFER_IN) {
      res = start_transmit(ep);
      if (res & USB_READ_NOTIFY) {
	notify_ep_process(ep, USB_EP_EVENT_NOTIFICATION);
      }
    } else {
      start_receive(ep);
    }
  }
}

static void transfer_complete(unsigned int hw_ep)
{
  uint32_t epr =  USB->EPR[hw_ep];
  USBEndpoint *ep = &usb_endpoints[hw_ep];
  if (epr &USB_EP0R_CTR_RX) {
    PRINTF("Received packet %lx %04x\n", USB_EP_BUF_DESC(hw_ep)->COUNT_RX, (int)USB->EPR[hw_ep]);
    if (epr & USB_EP0R_SETUP) {
      PRINTF("SETUP\n"); 
      ep->flags |= USB_EP_FLAGS_SETUP_PENDING;
    }

    if (IS_BULK_EP(ep)) {
      if ((epr ^ (epr >> 8)) & USB_EP0R_DTOG_TX) {
	ep->flags &= ~USB_EP_FLAGS_DOUBLE;
      } else {
	ep->flags |= USB_EP_FLAGS_DOUBLE;
	ep->flags &= ~USB_EP_FLAGS_RECEIVING;
      }
    } else {
      ep->flags &= ~USB_EP_FLAGS_RECEIVING;
    }
    ep->flags |= USB_EP_FLAGS_RECV_PENDING;
    if (IS_CONTROL_EP(ep)) epr &= ~USB_EPxR_EP_STATUS_OUT;
    USB->EPR[hw_ep] = EPR_INVARIANT(epr) & ~USB_EP0R_CTR_RX;
#if 0
    if (ep->flags & USB_EP_FLAGS_DOUBLE) {
      printf("Double\n");
    }
#endif

    start_transfer(ep);
  }
  if (epr &USB_EP0R_CTR_TX) {
     PRINTF("Sent packet\n"); 
    if (ep->flags & USB_EP_FLAGS_DOUBLE) {
      ep->flags &= ~USB_EP_FLAGS_DOUBLE;
    } else {
      ep->flags &= ~USB_EP_FLAGS_TRANSMITTING;
    }
    USB->EPR[hw_ep] = EPR_INVARIANT(USB->EPR[hw_ep]) & ~USB_EP0R_CTR_TX;
    start_transfer(ep);
  }
  
}

void usb_set_ep_event_process(unsigned char addr, struct process *p)
{
  USBEndpoint *ep = &usb_endpoints[EP_INDEX(addr)];
  ep->event_process = p;
}

/* Select what process should be polled when a global event occurs */
void usb_arch_set_global_event_process(struct process *p)
{
  event_process = p;
}

unsigned int usb_arch_get_global_events(void)
{
  unsigned int e;
  USB_DISABLE_INT;
  e = events;
  events = 0;
  USB_DISABLE_INT;
  return e;
}

unsigned int usb_get_ep_events(unsigned char addr)
{
  unsigned int e;
  unsigned int ei = EP_HW_NUM(addr);
  USB_DISABLE_INT;
  e = usb_endpoints[ei].events;
  usb_endpoints[ei].events = 0;
  USB_ENABLE_INT;
  return e;
}

void usb_submit_recv_buffer(unsigned char ep_addr, USBBuffer *buffer)
{
  USBBuffer **tailp;
  USBEndpoint *ep = &usb_endpoints[EP_INDEX(ep_addr)];
  if (!(ep->flags & USB_EP_FLAGS_ENABLED)) return;
  /* PRINTF("buffer: %p\n", ep->buffer); */
  /* dbg_drain(); */
  USB_DISABLE_INT;
  tailp = (USBBuffer**)&ep->buffer;
  while(*tailp) {
    tailp = &(*tailp)->next;
  }
  *tailp = buffer;
  while(buffer) {
    buffer->flags |= USB_BUFFER_SUBMITTED;
    buffer = buffer->next;
  }
  start_transfer(ep);
  
  USB_ENABLE_INT;
}

void usb_submit_xmit_buffer(unsigned char ep_addr, USBBuffer *buffer)
{
  USBBuffer **tailp;
  USBEndpoint *ep = &usb_endpoints[EP_INDEX(ep_addr)];
  if (!(ep->flags & USB_EP_FLAGS_ENABLED)) return;
  /* PRINTF("usb_submit_xmit_buffer %d\n", buffer->left); */
  USB_DISABLE_INT;
  tailp = (USBBuffer**)&ep->buffer;
  while(*tailp) {
    tailp = &(*tailp)->next;
  }
  *tailp = buffer;
  while(buffer) {
    buffer->flags |= USB_BUFFER_SUBMITTED | USB_BUFFER_IN;
    buffer = buffer->next;
  }
  start_transfer(ep);
  USB_ENABLE_INT;
}

void usb_arch_discard_all_buffers(unsigned char ep_addr)
{
  uint32_t ints;
  USBBuffer *buffer;
  volatile USBEndpoint *ep = &usb_endpoints[EP_INDEX(ep_addr)];
  ints = usb_save_disable_int();
  buffer = ep->buffer;
  ep->buffer = NULL;
#if 0
  /* Set both directions to NAK */
  USB->EPR[EP_HW_NUM(ep_addr)] =
    EPR_TOGGLE_SET(USB->EPR[EP_HW_NUM(ep_addr)],
		   USB_EP0R_STAT_RX|USB_EP0R_STAT_TX,
		   USB_EPxR_STAT_TX_NAK| USB_EPxR_STAT_RX_NAK);
  ep->flags &= ~(USB_EP_FLAGS_RECV_PENDING|USB_EP_FLAGS_SETUP_PENDING);
#endif
  ep->flags &= ~(USB_EP_FLAGS_RECV_PENDING | USB_EP_FLAGS_SETUP_PENDING
		 | USB_EP_FLAGS_DOUBLE);
  usb_restore_int(ints);
  while(buffer) {
    buffer->flags &= ~USB_BUFFER_SUBMITTED;
    buffer = buffer->next;
  }
}

uint16_t usb_arch_get_ep_status(uint8_t addr)
{
  if (EP_INDEX(addr) > USB_MAX_ENDPOINTS) return 0;
  return usb_endpoints[EP_INDEX(addr)].status;
}

