steup/contiki/cpu/arm/atsam3s4/usb-arch.c
void usb_arch_set_configuration(uint8_t usb_configuration_value)
{
  /* Nothing needs to be done */
}

void usb_arch_control_stall(unsigned char addr)
{
  if (EP_INDEX(addr) > USB_MAX_ENDPOINTS) return;
  uint32_t epr =  USB->EPR[EP_HW_NUM(addr)];
  USB->EPR[EP_HW_NUM(addr)] = EPR_TOGGLE_SET(epr,USB_EP0R_STAT_RX|USB_EP0R_STAT_TX, USB_EPxR_STAT_RX_STALL | USB_EPxR_STAT_TX_STALL);
}

/* Not for control endpoints */
void usb_arch_halt_endpoint(unsigned char ep_addr, int halt)
{
	if (EP_INDEX(ep_addr) > USB_MAX_ENDPOINTS)
	{
		return;
	}

	if (!(usb_endpoints[EP_INDEX(ep_addr)].flags & USB_EP_FLAGS_ENABLED))
	{
		return;
	}
  
  USB_DISABLE_INT;
  if (halt) {
    if (!(usb_endpoints[EP_INDEX(ep_addr)].status & 0x01)) {
      usb_endpoints[EP_INDEX(ep_addr)].status |= 0x01;
      if (ep_addr & 0x80) {
	stall_bulk_in(EP_HW_NUM(ep_addr));
      } else {
	stall_bulk_out(EP_HW_NUM(ep_addr));
      }
    }
  } else {
    USBEndpoint *ep = &usb_endpoints[EP_INDEX(ep_addr)];
    if (ep->status & 0x01) {
      ep->status &= ~0x01;
      PRINTF("HALT clear restart EPR: %04x %p %p\n",
	     (unsigned int)USB->EPR[EP_HW_NUM(ep_addr)],
	     ep->buffer, ep->buffer->next);
      /* Restore toggle state for double buffered endpoint */
      if (IS_BULK_EP(ep)) {
	volatile uint32_t *eprp = &USB->EPR[EP_HW_NUM(ep_addr)];
	if (ep_addr & 0x80) {
	  ep->flags &= ~(USB_EP_FLAGS_DOUBLE |USB_EP_FLAGS_TRANSMITTING);
	  
 	  *eprp =(EPR_TOGGLE_SET(*eprp,(USB_EP0R_STAT_TX | USB_EP0R_DTOG_TX 
					| USB_EPxR_SW_BUF_TX),
				 USB_EPxR_STAT_TX_VALID)); 
	} else {
	  ep->flags &= ~(USB_EP_FLAGS_DOUBLE | USB_EP_FLAGS_RECEIVING
			 | USB_EP_FLAGS_RECV_PENDING);

 	  *eprp =(EPR_TOGGLE_SET(*eprp,(USB_EP0R_STAT_RX | USB_EP0R_DTOG_RX 
					| USB_EPxR_SW_BUF_RX),
				 USB_EPxR_STAT_RX_VALID|USB_EPxR_SW_BUF_RX));
	  *eprp = EPR_INVARIANT(*eprp) | USB_EPxR_SW_BUF_RX;
	  
	}
      }
      /* Release HALT buffer */
      if (ep->buffer && (ep->buffer->flags & USB_BUFFER_HALT)) {
	ep->buffer->flags &= ~USB_BUFFER_SUBMITTED;
	if (ep->buffer->flags & USB_BUFFER_NOTIFY) {
	  notify_ep_process(ep,USB_EP_EVENT_NOTIFICATION);
	}
	ep->buffer = ep->buffer->next;
      }
      /* Restart transmission */
      start_transfer(&usb_endpoints[EP_INDEX(ep_addr)]);
      PRINTF("HALT clear restart EPR: %04x %p %p\n",
	     (unsigned int)USB->EPR[EP_HW_NUM(ep_addr)],
	     ep->buffer, ep->buffer->next);
      
    }
  }
  USB_ENABLE_INT;
}

void usb_arch_set_address(unsigned char addr)
{
  USB->DADDR = 0x80 | addr;  
}

void USB_HP_CAN_TX_handler(void)
{
  uint32_t status = USB->ISTR;
  if (status & USB_ISTR_CTR) {
    transfer_complete(status & USB_ISTR_EP_ID);
  }
}

void USB_LP_CAN_RX0_handler(void)
{
  uint32_t status = USB->ISTR;
  if (status & USB_ISTR_CTR) {
    transfer_complete(status & USB_ISTR_EP_ID);
    /* PRINTF("Transfer complete ep %ld\n", status & USB_ISTR_EP_ID); */
  } else if (status & USB_ISTR_PMAOVR) {
    PRINTF("PMAOVR\n");
    USB->ISTR &= ~USB_ISTR_PMAOVR;
  } else if (status & USB_ISTR_ERR) {
    PRINTF("ERR\n");
    USB->ISTR &= ~USB_ISTR_ERR;
  } else if (status & USB_ISTR_WKUP) {
    PRINTF("WKUP\n");
    USB->ISTR &= ~USB_ISTR_WKUP;
    USB->CNTR &= ~USB_CNTR_FSUSP;
    notify_process(USB_EVENT_RESUME);
  } else if (status & USB_ISTR_SUSP) {
    PRINTF("SUSP\n");
    USB->ISTR &= ~USB_ISTR_SUSP;
    USB->CNTR |= USB_CNTR_FSUSP;
    notify_process(USB_EVENT_SUSPEND);
  } else if (status & USB_ISTR_RESET) {
    PRINTF("RESET\n");
    USB->ISTR &= ~USB_ISTR_RESET;
    usb_arch_reset();
    notify_process(USB_EVENT_RESET);
  }
}

void usb_arch_toggle_SW_BUF_RX()
{
	USB->EPR[2] = EPR_INVARIANT(USB->EPR[2]) | USB_EPxR_SW_BUF_RX;
}

int usb_arch_send_pending(uint8_t ep_addr)
{
	return usb_endpoints[EP_INDEX(ep_addr)].flags & USB_EP_FLAGS_TRANSMITTING;
}
